#+BEGIN_SRC python
def digital_root(n):
    # 使用 map
    # return n if n < 10 else digital_root(sum(map(int,str(n))))
    if n < 10:
        return n
    return digital_root(sum(int(i) for i in str(n)))

return digital_root(493193)
#+END_SRC

#+RESULTS:
: 2
